{
    "mod_info": {
        "title": "Nuketown Remastered 1.2",
        "subtitle": "A recreation of Nuketown from BO2 as a base, and then expands drastically of the original map.",
        "description": "<center><p style=\"font-size: 24px; font-family: 'Arial';\">Map created by SirJammy & Ege115</p><br><iframe id=\"ytplayer\" type=\"text/html\" class=\"content_gallery\" src=\"https://www.youtube.com/embed/eGPayqpUIoA\"frameborder=\"0\"></iframe></center><br><br><p class=\"content_description\">Features:</p><ul class=\"content_list\"><li>An EE with an ending</li><li>Extended areas (Bunker entrance and the rest of the town itself)</li><li>FOV slider (In the game options menu)</li><li>Cod and BF weapons</li><li>Baby gun</li><li>Upgradeable C4</li><li>Claymores</li><li>Tactical Insertion</li><li>Watershoots</li><li>Zipline</li><li>WaW, BO1 perks and electric cherry from BO2</li><li>Buildable Shield (2 parts)</li><li>Buildable Rake trap (3 parts)</li><li>Electric water trap</li><li>EE song (Nightmare - By Avenged Sevenfold)</li></ul><br><br><p class=\"content_description\">Known bugs:</p><ul class=\"content_list\"><li>Zombies will bug out at the centre of spawn sometimes and we have tried for months to fix it, but nothing worked.</li><li>There is a visual glitch in the tunnel near the first water shoot.</li><li>The shield/rake trap has glitched 3rd person animations.</li></ul><br><br><p class=\"content_description\">Credits:</p><ul class=\"content_list\"><li>RDV</li><li>BluntStuffy</li><li>shippuden1592</li><li>HitmanVere</li><li>Lukkie1998</li><li>Codmoddd1234</li><li>Johndoe</li><li>Chromastone10</li><li>TomBMX</li><li>Rollonmath32</li><li>Smasher248</li><li>GreenBean - Billy Fredericks II</li><li>TheRelaxingEnd</li><li>CHN</li><li>thecaljitsu</li><li>KDXDARK</li><li>Makecents</li><li>DuaLVII</li><li>Treminaor</li><li>Ray1235</li></ul><br><br><p class=\"content_description\">Tip for opening bunker: The door is beind held shut with an electrical current. Blow up the power sources keeping that door shut!<br><br>Nuketown: Remastered is a recreation of Nuketown from BO2 as a base, and then expands drastically of the original map including being able to access the outside map houses & gardens, being able to unlock the bunker (which is far larger than the original Nuketown itself.)<br><br>The map itself took me over a year to map. Also Ege115 essentially brought the map together with scripting, adding weapons, fixing bugs and so much more for months on end.<br><br><a style=\"color: red; font-size: 24px\">Fixes and changes in Nuketown Remastered 1.1:</a></p><ul class=\"content_list\"><li>Changed it so you can now both have the rake trap and the zombie shield in your inventory</li><li>Changed it so you can have the normal ray gun and the not upgraded one when you go down with QR on solo.</li><li>Fixed the vision glitch that happens when the map restarts automatically after dying on solo. And no more black and white vision after taking a Time Warp powerup.</li><li>Fixed a hole in the ground where you could see through the map in the yello whouse garden next to where a shield part can be.</li><li>Fixed the game breaking glitch that made you get stuck on the ramp by Deadshot Daiquiri</li><li>Fixed Mule Kick in coop where if you went down and someone revived you, you'd still keep your third gun. And then afterwards get unlimited guns.</li><li>Fixed an issue where zombies start spawning in the blue house without actually opening to the blue house. The blue house will only have 1 debris so the zombies can get out of the house in some way.</li><li>Fixed some places where powerups could spawn outsize the map where you killed zombies.</li><li>Added a clip to a wooden pole under the outside stairs of the yellow house.</li></ul><br><br><p class=\"content_description\"><a style=\"color: red; font-size: 24px\">Fixes and changes in Nuketown Remastered 1.2:</a></p><ul class=\"content_list\"><li>The zombie spawning is improved, the map is now harder and more hectic!</li><li>Fixed the out of map exploit in the house by deadshot daiquiri</li><li>Fixed an open window that you couldn't shoot through.</li><li>Fixed another spot where powerups could spawn outside the map.</li><li>Fixed a bug were the game could crash if you're in laststand and try go with the zipline/watershoot/escape truck in the EE.</li><li>Fixed a bug were you couldn't melee when holding the MK-11</li><li>Added the correct ammo stats for the upgraded PPSH-41.</li><li>Buffed galvaknuckles so it's 1 hit kill up to 15, before it was round 14.</li><li>Added more traverses for zombies to get to you.</li></ul>",
        "game": "Call of Duty: World at War"
    },
    "banner": "banner.webp",
    "screenshots": [
        "screen_0.webp",
        "screen_1.webp",
        "screen_2.webp",
        "screen_3.webp",
        "screen_4.webp",
        "screen_5.webp",
        "screen_6.webp"
    ],
    "download_name": "waw_nuketown_remastered_1_2/nuketown_remastered.zip"
}